Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། ཆོས་ཐམས་ཅད་ལ་སྒྱུ་མར་བྱས་པའི་འདུ་ཤེས་ཉེ་བར་གནས་ཏེ།
en: Dt.179} “Moreover, Venerable Śāradvatīputra, bodhisattva great beings practice the perfection of wisdom, and maintain the notion that all phenomena are illusory.

source: ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས་མ་ཡིན་གྱི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་རློམ་སེམས་སུ་མི་བྱེད་དེ། དགེ་བའི་རྩ་བ་དེ་ཡང་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཤིང་།
en: Without the considerations of śrāvakas or pratyekabuddhas, but through the focusing of their attention with all-aspect omniscience in mind, they do not give rise to conceits about the perfection of wisdom, and indeed they dedicate the roots of their virtuous actions for the sake of unsurpassed, complete enlightenment, making common cause with all beings.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་གོ་ཆ་སྟེ།
en: This is the armor of the perfection of wisdom possessed by bodhisattva great beings who practice the perfection of wisdom.

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་ཀྱིས། ཕ་རོལ་དུ་ཕྱིན་པ་འདི་དག་དང་། སེམས་ཅན་དང་། བྱང་ཆུབ་ལ་མཚན་མར་མི་བྱེད་ཅིང་།
en: Venerable Śāradvatīputra, bodhisattva great beings, with minds associated with all-aspect omniscience, neither conceptualize nor apprehend these six perfections, beings, or enlightenment.

source: མི་དམིགས་པ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་གི་གོ་ཆ་ཆེན་པོའོ།
en: This is the great armor of the six perfections possessed by bodhisattva great beings who practice the perfection of wisdom.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། ཕ་རོལ་དུ་ཕྱིན་པ་རེ་རེ་ལ་གནས་ཤིང་། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་པོ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: So it is, Venerable Śāradvatīputra, that bodhisattva great beings maintain each of the perfections and perfect all six perfections. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་ལ་ཡང་མཉམ་པར་གཞོག་སྟེ། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་ཀྱི་རོ་ཡང་མྱོང་བར་མི་བྱེད་དོ། །བསམ་གཏན་དང་།
en: Moreover, Venerable Śāradvatīputra, bodhisattva great beings become absorbed in the meditative concentrations, the immeasurable attitudes, and the formless absorptions, but they do not at all relish those meditative concentrations, immeasurable attitudes, and formless absorptions.

source: ཚད་མེད་པ་དང་། གཟུགས་མེད་པ་དེ་དག་གིས་ཀྱང་མི་འཕྲོགས་ཏེ། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པའི་དབང་གིས་ཀྱང་མི་སྐྱེའོ།
en: They are not captivated by those meditative concentrations, immeasurable attitudes, and formless absorptions, and they will not be reborn on account of those meditative concentrations, immeasurable attitudes, and formless absorptions.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ། ཐབས་མཁས་པ་དང་འགྲོགས་པའོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་།
en: This, Venerable Śāradvatīputra, is the perfection of wisdom possessed by bodhisattva great beings in association with skillful means. “

source: གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དག་ལ་དབེན་པ་མཐོང་བ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་མཐོང་བས་མཉམ་པར་གཞོག་སྟེ། དེ་དག་གི་དབང་གིས་ཀྱང་མི་སྐྱེ།
en: Moreover, Venerable Śāradvatīputra, bodhisattva great beings become absorbed in the meditative concentrations, immeasurable attitudes, and formless absorptions through their vision of freedom and their vision of emptiness, signlessness, and wishlessness, but they will not be reborn on account of those [experiences], nor will they actualize the very limit of reality.

source: ཡང་དག་པའི་མཐའ་མངོན་དུ་ཡང་མི་བྱེད་དེ། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱང་ཟིལ་གྱིས་གནོན་ཏོ།
en: They will also overwhelm all śrāvakas and pratyekabuddhas.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཐབས་མཁས་པའི་གོ་ཆ་ཆེན་པོ་སྟེ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གོ་ཆ་ཆེན་པོ་བགོས་པ་ཞེས་བྱའོ།
en: This, Venerable Śāradvatīputra, is the great armor of skillful means possessed by bodhisattva great beings who practice the perfection of wisdom.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟར་གོ་ཆ་ཆེན་པོ་བགོས་པ་ལ། ཤར་ཕྱོགས་དང་། ལྷོ་དང་། ནུབ་དང་། བྱང་དང་། བྱང་ཤར་དང་། ཤར་ལྷོ་དང་། ལྷོ་ནུབ་དང་། ནུབ་བྱང་དང་། འོག་དང་། སྟེང་གི་ཕྱོགས་ཀྱི་ཕྱོགས་རེ་རེའི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་བཞུགས་པ་རྣམས་ཀྱང་ཆེད་དུ་བརྗོད་པ་ཆེད་དུ་བརྗོད་ཅིང་།
en: Venerable Śāradvatīputra, it is in this way that bodhisattva great beings are said to don the great armor. “

source: མིང་ཡོངས་སུ་སྒྲོག་པ་མཛད་དེ། འཇིག་རྟེན་གྱི་ཁམས་ཆེ་གེ་མོ་ཞིག་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གོ་ཆ་ཆེན་པོ་བགོས་པ་འདི་ལྟ་བུ་ཞིག་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ། །སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱེད་དོ། །རྫུ་འཕྲུལ་གྱིས་རྣམ་པར་རྩེའོ་ཞེས་སྒྲ་རྗོད་པ་མཛད་དེ།
en: Venerable Śāradvatīputra, when bodhisattva great beings don the great armor in such ways, then, throughout the world systems of each direction—east, south, west, north, northeast, southeast, southwest, northwest, nadir, and zenith—numerous as the grains of sand of the river Gaṅgā, the lord buddhas who reside there will purposefully declare and proclaim their names, saying, ‘This bodhisattva great being, in such and such a world system, has donned the great armor, is bringing beings to maturity, is refining the buddhafields, and is even conjuring emanational forms through miraculous abilities!’ ” {

source: དབྱངས་རྗེས་སུ་སྒྲོག་གོ །སྨྲས་པ། ཚེ་དང་ལྡན་པ་གང་པོ་ཇི་ཙམ་གྱིས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་ཞེས་བྱ།
en: Dt.180} [Then Śāradvatīputra] asked, “Venerable Pūrṇa, by means of what is it said that bodhisattva great beings have entered upon the Great Vehicle?

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་ནི་གང་ཡིན། གང་པོས་སྨྲས་པ།
en: What is the Great Vehicle of bodhisattva great beings?” “

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་དེ། དེ་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། འདོད་པས་དབེན། སྡིག་ཏོ་མི་དགེ་བའི་ཆོས་ཀྱིས་དབེན་པ། རྟོག་པ་དང་བཅས་པ། དཔྱོད་པ་དང་བཅས་པ། དབེན་པ་ལས་སྐྱེས་པའི་དགའ་བ་དང་བདེ་བ་ཅན།
en: Venerable Śāradvatīputra,” replied Pūrṇa, “when bodhisattva great beings practice the six perfections, while practicing the perfection of generosity, they achieve and then maintain the first meditative concentration, where there is freedom from the passions [of the senses], and freedom from negative and nonvirtuous attributes, while ideation and scrutiny are present, alongside the joy and bliss that arise from that freedom.

source: བསམ་གཏན་དང་པོ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ། །དེ་བཞིན་དུ་བསམ་གཏན་གཉིས་པ་དང་། གསུམ་པ་དང་། བཞི་པ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ། །དེ་བྱམས་པ་དང་ལྡན་པའི་སེམས་རྒྱ་ཆེན་པོ། ཤིན་དུ་ཡངས་པ། མི་གཉིས་པ། ཚད་མེད་པ། གཅུགས་མེད་པ།
en: Similarly, they achieve and maintain the second, third, and fourth meditative concentrations. “

source: གནོད་པ་མེད་པ། ལྟོད་པ་མེད་པ། ཡོངས་སུ་རྫོགས་པ་ཤིན་དུ་བསྒོམས་པས། འཇིག་རྟེན་ཆོས་ཀྱི་དབྱིངས་ཀྱིས་ཀླས་པ། ནམ་མཁའི་མཐས་གཏུགས་པའི་ཕྱོགས་བཅུར་རྒྱས་པར་བཀང་སྟེ། མོས་པར་བྱས་ཤིང་། རྣམ་པར་སྤྱོད་དོ། །དེ་སྙིང་རྗེ་དང་ལྡན་པ་དང་། དགའ་བ་དང་ལྡན་པ་དང་། བཏང་སྙོམས་དང་ལྡན་པའི་སེམས་རྒྱ་ཆེན་པོ་ཤིན་དུ་ཡངས་པ། མི་གཉིས་པ། ཚད་མེད་པ། གཅུགས་མེད་པ། གནོད་པ་མེད་པ།
en: They are resolute and engaged in thoughts of loving kindness that permeate the world systems in the ten directions—within the whole infinity of the realm of phenomena and the very reaches of the realm of space—because they are vast, extensive, nondual, immeasurable, without enmity, free from harm, without rivalry, perfected, and well cultivated.

source: ལྟོད་པ་མེད་པ། ཡོངས་སུ་རྫོགས་པ། ཤིན་དུ་བསྒོམས་པས། འཇིག་རྟེན་ཆོས་ཀྱི་དབྱིངས་ཀྱིས་ཀླས་པ། ནམ་མཁའི་མཐས་གཏུགས་པའི་ཕྱོགས་བཅུ་རྒྱས་པར་བཀང་སྟེ། མོས་པར་བྱས་ཤིང་རྣམ་པར་སྤྱོད་དོ། །དེ་ཚད་མེད་པ་འདི་དག་དང་།
en: They are resolute and engaged in thoughts of compassion, empathetic joy, and equanimity that permeate the world systems in the ten directions—within the whole infinity of the realm of phenomena and the very reaches of the realm of space—because they are vast, extensive, nondual, immeasurable, free from enmity, free from harm, without rivalry, perfected, and well cultivated.

source: གཟུགས་མེད་པ་ན་ཡོད་པ་འདི་དག་ལ། ནམ་མཁའི་རྣམ་པ་དང་། ཚུལ་དང་། མཚན་མས་མཉམ་པར་གཞོག་ཅིང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྔོ་བ་འདི་ནི།
en: Absorbed in these immeasurable attitudes and in the formless [absorptions] that are all conjoined with the aspects, modes, and signs of space, they dedicate these [aspirations and absorptions] toward all-aspect omniscience.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །དེ་བཞིན་དུ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟེ།
en: This is the perfection of generosity possessed by bodhisattva great beings, and it is similar in the case of the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom.

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་ཞེས་བྱའོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་དང་ལྡན་པའི་སེམས་རྒྱ་ཆེན་པོ། ཤིན་དུ་ཡངས་པ། མི་གཉིས་པ། ཚད་མེད་པ། གཅུགས་མེད་པ། གནོད་པ་མེད་པ། ལྟོད་པ་མེད་པ། ཡོངས་སུ་རྫོགས་པ།
en: It is in this way, Venerable Śāradvatīputra, that bodhisattva great beings are said to have entered upon the Great Vehicle. “

source: ཤིན་དུ་བསྒོམས་པས། འཇིག་རྟེན་ཆོས་ཀྱི་དབྱིངས་ཀྱིས་ཀླས་པ། ནམ་མཁའི་མཐས་གཏུགས་པའི་ཕྱོགས་བཅུ་རྒྱས་པར་བཀང་སྟེ། མོས་པར་བྱས་ཤིང་རྣམ་པར་སྤྱོད་དོ། །སྙིང་རྗེ་དང་ལྡན་པ་དང་། དགའ་བ་དང་ལྡན་པ་དང་། བཏང་སྙོམས་དང་ལྡན་པའི་སེམས་རྒྱ་ཆེན་པོ། ཤིན་དུ་ཡངས་པ། མི་གཉིས་པ། ཚད་མེད་པ། གཅུགས་མེད་པ། གནོད་པ་མེད་པ།
en: Moreover, Venerable Śāradvatīputra, bodhisattva great beings are resolute and engaged in thoughts of loving kindness that permeate the world systems in the ten directions—within the whole infinity of the realm of phenomena and the very reaches of the realm of space—because they are vast, extensive, nondual, immeasurable, free from enmity, free from harm, without rivalry, perfected, and well cultivated.

source: ལྟོད་པ་མེད་པ། ཡོངས་སུ་རྫོགས་པ། ཤིན་དུ་བསྒོམས་པས། འཇིག་རྟེན་ཆོས་ཀྱི་དབྱིངས་ཀྱིས་ཀླས་པ། ནམ་མཁའི་མཐས་གཏུགས་པའི་ཕྱོགས་བཅུ་རྒྱས་པར་བཀང་སྟེ། མོས་པར་བྱས་ཤིང་རྣམ་པར་སྤྱོད་དོ།
en: They are resolute and engaged in thoughts of compassion, empathetic joy, and equanimity that permeate the world systems in the ten directions—within the whole infinity of the realm of phenomena and the very reaches of the realm of space—because they are vast, extensive, nondual, immeasurable, free from enmity, free from harm, without rivalry, perfected, and well cultivated.

source: །དེ་འདོད་པས་དབེན། སྡིག་ཏོ་མི་དགེ་བའི་ཆོས་ཀྱིས་དབེན་པ། རྟོག་པ་དང་བཅས། དཔྱོད་པ་དང་བཅས་པ། དབེན་པ་ལས་སྐྱེས་པའི་དགའ་བ་དང་བདེ་བ་ཅན་བསམ་གཏན་དང་པོ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: They achieve and then maintain the first meditative concentration, where there is freedom from the passions [of the senses], and freedom from negative and nonvirtuous attributes, while ideation and scrutiny are present, alongside the joy and bliss that arise from freedom.

source: །དེ་བཞིན་དུ་བསམ་གཏན་གཉིས་པ་དང་། གསུམ་པ་དང་། བཞི་པ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: Similarly, they achieve and maintain the second, third, and fourth meditative concentrations. “

source: །ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་དང་། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་དང་། ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: They achieve and then maintain the sphere of infinite space, the sphere of infinite consciousness, the sphere of nothing-at-all, and the sphere of neither perception nor nonperception.

source: །འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability possessed by bodhisattva great beings. “

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་སྙིང་རྗེ་ཆེན་པོ་སྔོན་དུ་འགྲོ་བས། ཉོན་མོངས་པ་རབ་ཏུ་སྤང་བའི་ཕྱིར། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དེ་དག་གཞན་ལ་རྗོད་ཅིང་། འཆད་པ་དང་། སྟོན་ཅིང་འགྲེལ་ལ། རྣམ་པར་འབྱེད་ཅིང་གསལ་བར་བྱེད་དེ།
en: Bodhisattva great beings, their minds associated with all-aspect omniscience and preceded by great compassion, describe, explain, teach, interpret, analyze, and elucidate these meditative concentrations, immeasurable attitudes, and formless absorptions to others, so that they might abandon afflicted mental states, and they correctly teach their savor, their defects, and the way they arise.

source: དེ་དག་གི་རོ་དང་། དེ་དག་གི་སྐྱོན་དང་། འབྱུང་བ་ཡང་ཚུལ་བཞིན་དུ་སྟོན་པ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ།
en: This is the perfection of generosity possessed by bodhisattva great beings. “

source: །ནམ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བ་དེ་དག་གིས། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དེ་དག་ལ་མཉམ་པར་གཞོག་ཅིང་། རྣམ་པར་ལྡང་ཡང་། འདི་ལྟ་སྟེ། ཉན་ཐོས་སམ།
en: When bodhisattva great beings, through the focusing of their attention with all-aspect omniscience in mind, are absorbed in these meditative concentrations, immeasurable attitudes, and formless absorptions, and even when they arise from them, they do not allow an opportunity for the mindsets of the śrāvakas or pratyekabuddhas, or any other mindsets, to develop. {

source: རང་སངས་རྒྱས་ཀྱི་སེམས་སམ། སེམས་བསྐྱེད་པ་གཞན་གྱི་གོ་མི་འབྱེད་པ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མཉམས་པའོ།
en: Dt.181} This is the unblemished perfection of ethical discipline possessed by bodhisattva great beings. “

source: །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དེ་དག་གིས་རྣམ་པར་སྤྱོད་པའི་ཚེ་འདི་སྙམ་སྟེ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་ཟད་པར་བྱ་བའི་ཕྱིར།
en: When bodhisattva great beings, through thus focusing of their attention with all-aspect omniscience in mind, engage in these meditative concentrations, immeasurable attitudes, and formless absorptions, they think, ‘I should teach the Dharma in order that the afflicted mental states of all beings might be ended!’

source: ཆོས་བསྟན་ཏོ་སྙམ་དུ་སེམས་ཤིང་། ཡིད་ལ་བྱ་བ་དེ་དག་ལ་བཟོད་པ་དང་། མོས་པ་དང་། རྟོག་པ་དང་། སེམས་ཤིང་ཁོང་དུ་ཆུད་པར་བྱེད་པ་འདི་ནི།
en: They then induce them to tolerate, resolve, scrutinize, contemplate, and comprehend those modes of focusing their attention.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ།
en: This is the perfection of tolerance possessed by bodhisattva great beings. “

source: །ནམ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དེ་དག་གིས་རྣམ་པར་སྤྱོད་པའི་ཚེ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཕྱིར།
en: When bodhisattva great beings, through the focusing of their attention with all-aspect omniscience in mind, engage in these meditative concentrations, immeasurable attitudes, and formless absorptions, it is for the sake of all beings and for the sake of all-aspect omniscience that they do not let their perseverance degenerate.

source: བརྩོན་འགྲུས་ཉམ་པར་མི་བྱེད་པ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ།
en: This is the perfection of perseverance possessed by bodhisattva great beings. “

source: །ནམ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་རྣམས་ལ་མཉམ་པར་གཞོག་ཅིང་། རྣམ་པར་ལྡང་ཡང་། ཉན་ཐོས་ཀྱི་ས་འམ།
en: When bodhisattva great beings, through the focusing of their attention with all-aspect omniscience in mind, become absorbed in the meditative concentrations, the [gateways to] liberation, the meditative stabilities, and the [formless] absorptions, and even when they arise [from those meditative states], they do not descend to the levels of the śrāvakas or pratyekabuddhas.

source: རང་སངས་རྒྱས་ཀྱི་སར་མི་ལྟུང་བ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །ནམ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། བསམ་གཏན་དང་པོའི་ཡན་ལག་དང་། བསམ་གཏན་གཉིས་པ་དང་།
en: This is the perfection of meditative concentration possessed by bodhisattva great beings. “

source: གསུམ་པ་དང་། བཞི་པའི་ཡན་ལག་དང་། བསམ་གཏན་གྱི་ཡན་ལག་མི་རྟག་པའི་རྣམ་པ་དང་། སྡུག་བསྔལ་བའི་རྣམ་པ་དང་། བདག་མེད་པའི་རྣམ་པ་དང་། ཞི་བའི་རྣམ་པ་དང་། སྟོང་པའི་རྣམ་པ་དང་། མཚན་མ་མེད་པའི་རྣམ་པ་དང་། སྨོན་པ་མེད་པའི་རྣམ་པ་རབ་ཏུ་རྟོག་ཀྱང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དེ་དག་མི་དམིགས་ཤིང་།
en: When bodhisattva great beings, through the focusing of their attention with all-aspect omniscience in mind, definitively discern that the aspects of the first meditative concentration, and the aspects of the second, third, and fourth meditative concentrations, are modes of impermanence, modes of suffering, modes of nonself, modes of peace, and modes of emptiness, signlessness, and wishlessness, they do not apprehend these meditative concentrations, immeasurable attitudes, and formless absorptions, and they do not give rise to conceits on the basis of them.

source: དེ་དག་གིས་རློམ་སེམས་མེད་པ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟེ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཐེག་པ་ཆེན་པོའོ།
en: This is the perfection of wisdom possessed by bodhisattva great beings.

source: །དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་ཡིན་ནོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་ནི། རྣམ་པ་ཐམས་ཅད་དུ་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་སྒོམ་པ་དང་། རྣམ་པ་ཐམས་ཅད་དུ་འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་།
en: It is in these ways that bodhisattva great beings have entered the Great Vehicle. “

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་སྒོམ་པ་དང་།
en: Moreover, Śāradvatīputra, the Great Vehicle of bodhisattva great beings cultivates in all respects the thirty-seven factors conducive to enlightenment, and in all respects the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the gateways of the meditative stabilities and dhāraṇīs, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas, and it cultivates in all respects all the [goals], up to and including all-aspect omniscience.

source: རྣམ་པ་ཐམས་ཅད་དུ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་སྒོམ་པ་སྟེ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏི་བུ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོའོ།
en: This, Venerable Śāradvatīputra, is the Great Vehicle of bodhisattva great beings. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པའི་ཏིང་ངེ་འཛིན་ལ་མཉམ་པར་གཞོག་ཅིང་། བདག་གིས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པར་བྱའོ་ཞེས། དེ་ལ་གཞོལ་བར་བྱེད་དོ།
en: Moreover, Śāradvatīputra, bodhisattva great beings should be absorbed in the meditative stability of loving kindness and focus on it, saying, ‘I should save all beings!’ {

source: །སྙིང་རྗེའི་ཏིང་ངེ་འཛིན་ལ་མཉམ་པར་གཞོག་ཅིང་། སེམས་ཅན་རྣམས་ལ་སྙིང་རྗེ་བ་དང་། སྙིང་བརྩེ་བའི་ཉམས་སུ་བྱེད་དོ།
en: Dt.182} They should be absorbed in the meditative stability of compassion and generate compassion and love for beings.

source: །དགའ་བའི་ཏིང་ངེ་འཛིན་ལ་མཉམ་པར་གཞོག་ཅིང་། བདག་ཉིད་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་དགྲོལ་བར་བྱའོ་ཞེས་སེམས་ཅན་རྣམས་ལ་སེམས་སོ།
en: They should be absorbed in the meditative stability of empathetic joy and direct their thoughts toward beings, saying, ‘I should liberate all beings!’

source: །བཏང་སྙོམས་ཀྱི་ཏིང་ངེ་འཛིན་ལ་མཉམ་པར་གཞོག་ཅིང་། སེམས་ཅན་རྣམས་ཀྱི་ཟག་པ་ཟད་པར་བྱ་བ་ལ་རབ་ཏུ་གཞོལ་བར་བྱེད་དེ།
en: They should be absorbed in the meditative stability of equanimity, and focus on the resolve that beings might achieve the cessation of contaminants.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚད་མེད་པ་རྣམས་ལ་སྤྱོད་པའི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །ནམ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། བསམ་གཏན་དང་། ཚད་མེད་པ་རྣམས་ཀྱི་རྣམ་པ་དང་། ཚུལ་དང་།
en: This is the perfection of generosity possessed by bodhisattva great beings who practice the immeasurable attitudes. “

source: མཚན་མ་ལ་མཉམ་པར་གཞོག་ཅིང་། རྣམ་པར་ལྡང་ཡང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་བསྔོ་བ་མ་གཏོགས་པར་ཉན་ཐོས་ཀྱི་ས་དང་། རང་སངས་རྒྱས་ཀྱི་སར་ཡོངས་སུ་མི་སྔོ་བ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚད་མེད་པ་རྣམས་ལ་སྤྱོད་པའི།
en: When bodhisattva great beings are absorbed in the aspects, modes, and signs of these meditative concentrations and immeasurable attitudes, and also when they arise [from these meditative states], they do not dedicate these to the level of the śrāvakas or the level of the pratyekabuddhas, and instead only dedicate them to all-aspect omniscience.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་མ་ཉམས་པའོ། །ནམ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དེ་དག་གིས་མ་འདྲེས་པར་རྣམ་པར་སྤྱོད་ཅིང་། ས་གཉིས་པོ།
en: This is the unblemished perfection of ethical discipline possessed by bodhisattva great beings who practice the immeasurable attitudes. “

source: ཉན་ཐོས་ཀྱི་ས་འམ། རང་སངས་རྒྱས་ཀྱི་སར་འདོད་པ་མི་སྐྱེད་ཀྱི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་མོས་ཤིང་དགའ་བ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚད་མེད་པ་རྣམས་ལ་སྤྱོད་པའི། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ།
en: When bodhisattva great beings engage in the meditative concentrations, the immeasurable attitudes, and the formless absorptions, without confusing them, and do not develop a desire for those two levels—the level of the śrāvakas or the level of the pratyekabuddhas—but aspire to and delight in all-aspect omniscience, this is the perfection of tolerance possessed by bodhisattva great beings who practice the immeasurable attitudes. “

source: །ནམ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་བསྐྱེད་པས། མི་དགེ་བའི་ཆོས་རྣམས་རབ་ཏུ་སྤང་བ་དང་། དགེ་བའི་ཆོས་ཕུན་སུམ་ཚོགས་པར་བྱ་བའི་དོན་དུ། བརྩོན་འགྲུས་མི་གཏོང་བས་རྣམ་པར་སྤྱོད་པ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚད་མེད་པ་རྣམས་ལ་སྤྱོད་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །ནམ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་དང་།
en: When bodhisattva great beings, with their minds set on all-aspect omniscience, engage relentlessly in order to abandon nonvirtuous actions and excel in virtuous actions, this is the perfection of perseverance possessed by bodhisattva great beings who practice the immeasurable attitudes. “
